---
kind: type
id: T:Autodesk.Revit.DB.PointClouds.PointCloudColorEncoding
source: html/1073d329-2fd5-bbdf-387b-cf0501e76725.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudColorEncoding

The color encodings supported by Revit point clouds.

## Syntax (C#)
```csharp
public enum PointCloudColorEncoding
```